In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0028201.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(162, 8)

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7
0,NaN,NaN,"Douglas 226,292","Echols 248,226","Totals 474,518",NaN,NaN,NaN
1,NaN,NaN,47.7%,52.3%,100.0%,NaN,NaN,NaN
2,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN
3,APPLING,100%,715,523,1238,NaN,NaN,NaN
4,ATKINSON,100%,119,89,208,NaN,NaN,NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

          0     1    2    3     4   5   6   7
3   APPLING  100%  715  523  1238 NaN NaN NaN
4  ATKINSON  100%  119   89   208 NaN NaN NaN
5     BACON  100%  262  280   542 NaN NaN NaN
6     BAKER  100%   71   82   153 NaN NaN NaN
7   BALDWIN  100%  667  708  1375 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

          0    2    3
3   APPLING  715  523
4  ATKINSON  119   89
5     BACON  262  280
6     BAKER   71   82
7   BALDWIN  667  708

In [12]:
df.columns = ['county', 'John Douglas', 'Tim Echols']

In [13]:
df.tail(5)

        county John Douglas Tim Echols
157  WHITFIELD         2876       2210
158     WILCOX          391        255
159     WILKES          154        273
160  WILKINSON          193        172
161      WORTH          579        558

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

     county     candidate votes
0   APPLING  John Douglas   715
1  ATKINSON  John Douglas   119
2     BACON  John Douglas   262
3     BAKER  John Douglas    71
4   BALDWIN  John Douglas   667

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 318 entries, 0 to 317
Data columns (total 3 columns):
county       318 non-null object
candidate    318 non-null object
votes        318 non-null int64
dtypes: int64(1), object(2)
memory usage: 7.5+ KB

In [19]:
df['office'] = 'Public Service Commission'

In [20]:
df['district'] = '2'

In [21]:
df['party'] = 'Republican'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate     party
John Douglas  Republican    226292
Tim Echols    Republican    248226
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Public Service Commission,2,Republican,John Douglas,715
1,ATKINSON,Public Service Commission,2,Republican,John Douglas,119
2,BACON,Public Service Commission,2,Republican,John Douglas,262
3,BAKER,Public Service Commission,2,Republican,John Douglas,71
4,BALDWIN,Public Service Commission,2,Republican,John Douglas,667

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')